app/views/users/user_with_token.json.jbuilder

end
json.token(Auth.create_token(@user.id))
---
INSERT INTO "users" ("username", "password_digest", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"