app/controllers/api/v1/auth_controller.rb

  def login
    @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]