app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "b20@b20.com"], ["LIMIT", 1]]
---
  def login
    binding.pry
    @user = User.find_by(username: params[:user][:username])