app/controllers/api/v1/books_controller.rb

SELECT "books".* FROM "books"
---
   def index

         render json: Book.all.to_json()