app/controllers/api/v1/books_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
   def index
      @books = User.find_by(id: params[:user_id])&.books

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def show
      @book = Book.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
INSERT INTO "books" ("title", "author", "rating", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test1"], ["author", "author1"], ["rating", 8], ["notes", "notes1"], ["created_at", "2017-09-06 17:38:35.738339"], ["updated_at", "2017-09-06 17:38:35.738339"]]
---
   def create

      @user = User.find_by(id: params[:user_id])
      if @user.id == current_user.id

            @book = @user.decisions.new(book_params)

        if @book.save