app/controllers/api/v1/users_controller.rb

   def create

    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"